{
  "baseUrl": "https://stochastic-philosophy.github.io/welfare-state-1/",
  "title": "Hyvinvointivaltion analyysi: Kokonaisuus",
  "description": "Kattava analyysi hyvinvointivaltiosta kolmesta näkökulmasta: perustelut ja toimivuus, systemaattinen heikentäminen, sekä keskustelun moraaliset ja psykologiset juuret.",
  "sections": [
    {
      "id": "kokonaisuus-a",
      "title": "KOKONAISUUS A: Hyvinvointivaltion perustelut",
      "description": "Tämä kokonaisuus argumentoi hyvinvointivaltion puolesta kolmesta näkökulmasta: yhteiskunnallinen vakaus ja turvallisuus, historiallinen oppiminen ja politiikan syklisyys, sekä innovaatio ja koulutus. Keskeisenä teemana on, että hyvinvointivaltio on sekä taloudellisesti rationaalinen että moraalisesti perusteltu vaihtoehto.",
      "parts": [
        {
          "id": "osa-1",
          "title": "Osa 1: Yhteiskunnallisen vakauden perustat",
          "description": "Tarkastelee hyvinvointivaltion roolia yhteiskunnallisen vakauden ylläpitäjänä erityisesti vauraiden kansalaisten näkökulmasta. Argumentoi, että hyvinvointivaltio on paradoksaalisesti juuri niiden ihmisten perustavanlaatuinen turvallisuustekijä, jotka usein vastustavat sitä voimakkaimmin. Sisältää historiallista analyysia vallankumouksista ja kriiseistä.",
          "chapters": [
            {
              "title": "Johdanto ja rajaukset",
              "description": "Esittelee tekstin lähtökohdat ja tunnustaa avoimesti argumentatiivisen luonteen. Määrittelee hyvinvointivaltion käsitteen viittaamaan erityisesti pohjoismaiseen malliin.",
              "file": "content/yhteiskunta_sopimus_v2_osa1.md"
            },
            {
              "title": "Lyhytnäköisen itsekkyyden paradoksi",
              "description": "Esittelee IMF:n tunnustaman yhteyden eriarvoisuuden ja taloudellisen riskin välillä. Analysoi, miksi lyhyen aikavälin itsekkäät valinnat voivat horjuttaa yhteiskunnallista perustaa pitkällä aikavälillä.",
              "file": "content/yhteiskunta_sopimus_v2_osa1.md"
            },
            {
              "title": "Ranskan vallankumous: Monitekijäinen kriisi",
              "description": "Tutkii Ranskan vallankumousta (1789) esimerkkinä monimutkaisesta kriisistä, jossa verotuksen epäoikeudenmukaisuus, äärimmäinen eriarvoisuus ja muut tekijät yhdistyivät. Korostaa, ettei kyse ollut yksinkertaisesta 'köyhät vastaan rikkaat' -konfliktista.",
              "file": "content/yhteiskunta_sopimus_v2_osa1.md"
            },
            {
              "title": "Venäjän vallankumous: Sodan paljastama heikkous",
              "description": "Analysoi Venäjän vallankumouksia 1917 osoittamaan, miten äärimmäinen eriarvoisuus yhdistettynä sotaan ja poliittiseen sortoon johti tsaarijärjestelmän romahtamiseen. Painottaa tekijöiden monitekijäisyyttä.",
              "file": "content/yhteiskunta_sopimus_v2_osa1.md"
            },
            {
              "title": "1930-luvun Saksa: Säästöpolitiikan tuhoisa kierre",
              "description": "Tarjoaa varoittavan esimerkin siitä, miten taloudellinen kriisi ja erityisesti säästöpolitiikka loivat hedelmällisen maaperän radikalismille. Osoittaa tuoreen tutkimuksen perusteella, että säästötoimet kiihdyttivät natsipuolueen kannatusta.",
              "file": "content/yhteiskunta_sopimus_v2_osa1.md"
            },
            {
              "title": "Nyky-Yhdysvallat: Eriarvoisuuden seuraukset reaaliajassa",
              "description": "Tarkastelee Yhdysvaltoja modernina esimerkkinä siitä, miten pitkäaikainen eriarvoisuuden kasvu voi heikentää yhteiskunnallista vakautta. Dokumentoi eläketurvakriisin ja poliittisen polarisaation kasvun.",
              "file": "content/yhteiskunta_sopimus_v2_osa2.md"
            },
            {
              "title": "Hyvinvointivaltio vakauden rakentajana",
              "description": "Analysoi, mitä onnistuneet hyvinvointivaltiot ovat tehneet oikein. Tarkastelee pohjoismaista mallia ja sen kolmea keskeistä funktiota: yhteiskuntarauha, poliittinen vakaus ja taloudellinen vakaus.",
              "file": "content/yhteiskunta_sopimus_v2_osa2.md"
            },
            {
              "title": "Yhteisten alueiden tragedia ja sen ratkaisu",
              "description": "Soveltaa taloustieteen klassista ongelmaa hyvinvointivaltio-kysymykseen. Argumentoi, että vaikka verojen välttäminen voi olla yksilöllisesti rationaalista, se johtaa kollektiiviseen tappioon kun kaikki toimivat samoin.",
              "file": "content/yhteiskunta_sopimus_v2_osa2.md"
            },
            {
              "title": "Itsesuojeluvaisto hyvinvointivaltion perustana",
              "description": "Esittää, että vahvin argumentti hyvinvointivaltion puolesta on kylmän rationaalinen itsesuojeluvaisto: halu varmistaa turvallinen ja vakaa yhteiskunta omille jälkeläisille. Viittaa Piketty'n tutkimukseen 1914-1980 'suuresta uudelleenjaosta'.",
              "file": "content/yhteiskunta_sopimus_v2_osa3.md"
            },
            {
              "title": "Pakosuunnitelmien todellisuus",
              "description": "Käsittelee ajatusta siitä, että varakkaat voisivat 'paeta' yhteiskunnallisen epävakauden seurauksilta. Osoittaa tämän strategian perustavanlaatuiset ongelmat: globalisaatio, nopeat murrokset ja eristettyjen kuplien sokaiseva vaikutus.",
              "file": "content/yhteiskunta_sopimus_v2_osa3.md"
            },
            {
              "title": "Johtopäätökset",
              "description": "Kokoaa yhteen analyysin keskeiset havainnot: hyvinvointivaltio ei ole 'rikkaiden riistoa' vaan rikkaiden perustavanlaatuinen turvallisuustekijä. Esittää lopullisen kysymyksen: haluavatko tämän hetken varakkaat olla viimeinen vauraiden sukupolvi historiassa?",
              "file": "content/yhteiskunta_sopimus_v2_osa3.md"
            }
          ]
        },
        {
          "id": "osa-2",
          "title": "Osa 2: Politiikan oppimishaaste",
          "description": "Tarkastelee sitä, miksi poliittinen päätöksenteko näyttää toistavan samoja virheitä sukupolvesta toiseen, vaikka tieteellinen tieto kehittyy kumulatiivisesti. Argumentoi, että ideologiset sokkoläpät ja lyhyt poliittinen muisti estävät systemaattisesti oppimista empiirisestä näytöstä. Käyttää esimerkkinä 1970-luvun stagflaatiota ja uusliberalismin nousua.",
          "chapters": [
            {
              "title": "Johdanto ja rajaukset",
              "description": "Esittelee tekstin kysymyksenasettelun: miksi politiikka ei opi samalla tavalla kuin tiede? Tunnustaa argumentatiivisen lähestymistavan ja viittaa historiallisiin esimerkkeihin tukemaan väitteitä.",
              "file": "content/oppimiskatko_v2_osa1.md"
            },
            {
              "title": "Tieteen kumulatiivinen luonne vs. politiikan syklisyys",
              "description": "Vertaa tieteen kumulatiivista kehitystä ('jättiläisten hartioilla seisominen') politiikan sykliseen luonteeseen, jossa samat virheet toistuvat. Esittää, että politiikassa oppimismalli on perustavanlaatuisesti rikki.",
              "file": "content/oppimiskatko_v2_osa1.md"
            },
            {
              "title": "Pohjoismaisen hyvinvointivaltion empiirinen menestys",
              "description": "Dokumentoi pohjoismaisen mallin historiallisen menestyksen vuosikymmeninä 1950-1980. Korostaa, että malli ei ollut täydellinen tai staattinen, mutta tuotti erinomaisia tuloksia kulta-aikanaan.",
              "file": "content/oppimiskatko_v2_osa1.md"
            },
            {
              "title": "Stagflaatio ja 1970-luvun kriisi: Monimutkaisempi kuva",
              "description": "Analysoi 1970-luvun stagflaatiota ja sen todellisia syitä: öljykriisit, Bretton Woods -järjestelmän romahdus, rahapolitiikka ja tuottavuuden lasku. Osoittaa, että keynesiläinen malli oli riittämätön eikä 'epäonnistunut'.",
              "file": "content/oppimiskatko_v2_osa1.md"
            },
            {
              "title": "Stagflaation ratkaisu: Volcker, ei Reagan",
              "description": "Osoittaa, että stagflaation ratkaisi Federal Reserve -pankin pääjohtaja Paul Volcker tiukalla rahapolitiikalla, ei presidentti Reaganin 'vapaat markkinat' -politiikka. Tämä on kriittinen korjaus vallitsevaan narratiiviin.",
              "file": "content/oppimiskatko_v2_osa2.md"
            },
            {
              "title": "Uusliberalismi ja Reaganomics: Lupausten ja todellisuuden välinen kuilu",
              "description": "Tarkastelee Reaganomicsin teorioita ja todellisia tuloksia. Dokumentoi, että vaikka talous kasvoi, verojen leikkaukset eivät 'maksaneet itseään takaisin', ja Kansas-kokeilu 2010-luvulla epäonnistui samalla tavalla.",
              "file": "content/oppimiskatko_v2_osa2.md"
            },
            {
              "title": "Ideologian voitto tosiasioiden yli",
              "description": "Analysoi, miksi supply-side-taloustiede jatkaa elämäänsä huolimatta vahvasta empiirisestä näytöstä sen epäonnistumisesta. Tunnistaa syitä: lyhyt muisti, ideologinen sitoutuminen, ekonomistien työllisyys ja narratiivien yksinkertaisuus.",
              "file": "content/oppimiskatko_v2_osa2.md"
            },
            {
              "title": "Nyky-Suomen tilanne: Varoittavia merkkejä",
              "description": "Tarkastelee Suomen kehitystä, erityisesti akateemisen vapauden laskua Academic Freedom Indexin mukaan. Mainitsee myös muita huolestuttavia trendejä sosiaaliturvan riittävyydessä ja julkisten palvelujen heikkenemisessä.",
              "file": "content/oppimiskatko_v2_osa3.md"
            },
            {
              "title": "Oppimisen systemaattiset esteet politiikassa",
              "description": "Tunnistaa viisi keskeistä estettä: institutionaalisen muistin tuhoaminen, narratiivisten yksinkertaistusten voima, ideologinen sokeus, lyhyen tähtäimen ajattelu ja median manipulaatio.",
              "file": "content/oppimiskatko_v2_osa3.md"
            },
            {
              "title": "Kohti todellista poliittista oppimista",
              "description": "Ehdottaa ratkaisuja: empiirisen päätöksenteon kulttuuri, institutionaalisen muistin palauttaminen, pitkäjänteinen ajattelu ja median riippumattomuus. Painottaa, että muutos on mahdollinen.",
              "file": "content/oppimiskatko_v2_osa3.md"
            },
            {
              "title": "Johtopäätökset",
              "description": "Kokoaa yhteen analyysin: siinä missä tiede kehittyy järjestelmällisesti, yhteiskunta näyttää toistavan ikuisesti samoja virheitä ideologisista syistä. Jos haluamme todella oppia, meidän on arvostettava empiiristä näyttöä ideologisen puhtauden sijaan.",
              "file": "content/oppimiskatko_v2_osa3.md"
            }
          ]
        },
        {
          "id": "osa-3",
          "title": "Osa 3: Innovaatio ja laajapohjainen koulutus",
          "description": "Argumentoi sen puolesta, että yhteiskunnan tulisi investoida laajaan, korkealaatuiseen koulutukseen innovaation näkökulmasta. Keskeisenä argumenttina on lahjakkuuden ennustamattomuus ja innovaatioekosysteemien monimutkaisuus, jotka tekevät laajasta koulutuspanostuksesta sekä taloudellisesti rationaalisen että oikeudenmukaisuusnäkökulmasta puolustettavan valinnan.",
          "chapters": [
            {
              "title": "Johdanto ja rajaukset",
              "description": "Esittelee tekstin kysymyksenasettelun: miksi yhteiskunnan tulisi investoida laajaan koulutukseen innovaation näkökulmasta? Tunnustaa argumentatiivisen lähestymistavan ja korostaa, että argumentti ei riipu väitteestä 'kaikki ovat yhtä lahjakkaita'.",
              "file": "content/innovaatio_v2_osa1.md"
            },
            {
              "title": "Lahjakkuuden ennustamattomuus: Mitä tutkimus kertoo?",
              "description": "Esittää tutkimukseen perustuvan argumentin siitä, että todellista luovaa lahjakkuutta on vaikea ennustaa etukäteen. Viittaa tutkimukseen innovaation ennustamattomuudesta ja lahjakkuuden väärästä allokaatiosta, joka voi alentaa talouden kasvua jopa 10 prosentilla.",
              "file": "content/innovaatio_v2_osa1.md"
            },
            {
              "title": "Innovaatioekosysteemin monimutkaisuus",
              "description": "Osoittaa, että yksittäinen nero ei koskaan riitä - innovaatio syntyy monimutkaisessa ekosysteemissä. Viittaa Scott E. Pagen tutkimukseen kognitiivisen monimuotoisuuden merkityksestä ja 'diversity bonus' -ilmiöön.",
              "file": "content/innovaatio_v2_osa1.md"
            },
            {
              "title": "Verkostovaikutukset ja kriittinen massa",
              "description": "Analysoi, miten korkeakoulutuksella on voimakkaita verkostovaikutuksia, jotka kasvavat eksponentiaalisesti koulutetun väestön määrän mukaan. Viittaa tutkimukseen innovaatiokeskittymistä kuten Piilaaksosta.",
              "file": "content/innovaatio_v2_osa1.md"
            },
            {
              "title": "Suomen historiallinen tapaustutkimus: Menestys ja sen perusta",
              "description": "Tarkastelee Suomen koulutuspanostusten historiaa ja Nokian tapausta esimerkkinä symbioosista koulutuksen ja innovaation välillä. Dokumentoi, että 'Nokia palkkasi käytännössä jokaisen suomalaisen insinöörivalmistuneen'. Käsittelee myös PISA-menestystä ja sen taustalla olevia tekijöitä.",
              "file": "content/innovaatio_v2_osa2.md"
            },
            {
              "title": "PISA-tulosten lasku: Monitekijäinen ilmiö",
              "description": "Analysoi Suomen PISA-tulosten johdonmukaista laskua vuodesta 2006 lähtien. Esittelee useita tutkijoiden tulkintoja: yhteiskunnalliset muutokset, opetussuunnitelmamuutokset, desentralisaatio ja maahanmuutto. Korostaa, että lasku on merkittävä erityisesti eriarvoisuuden kasvun vuoksi.",
              "file": "content/innovaatio_v2_osa2.md"
            },
            {
              "title": "Koulutusleikkaukset ja tulevaisuuden riskit",
              "description": "Dokumentoi akateemisen vapauden heikkenemisen Suomessa ja resurssileikkaukset. Varoittaa, että nämä kehityssuunnat uhkaavat yhteiskunnan pitkän aikavälin innovaatiokykyä.",
              "file": "content/innovaatio_v2_osa2.md"
            },
            {
              "title": "Koulutuksen markkinoistuminen: Kriittinen tarkastelu",
              "description": "Tarkastelee koulutuksen käsitteellistämistä yhä enemmän yksityishyödykkeenä julkishyödykkeen sijaan. Analysoi tämän muutoksen potentiaalisia ongelmia innovaation näkökulmasta.",
              "file": "content/innovaatio_v2_osa3.md"
            },
            {
              "title": "Koulutuksen oikeudenmukaisuus ja tehokkuus: Eivät vastakohtia vaan synergisiä",
              "description": "Argumentoi, että innovaation näkökulmasta oikeudenmukaisuus ja tehokkuus ovat samaa asiaa. Kun annamme kaikille mahdollisuuden kehittää lahjakkuutensa, maksimoimme yhteiskunnan innovaatiopotentiaalin.",
              "file": "content/innovaatio_v2_osa3.md"
            },
            {
              "title": "Globaali kilpailu ja Suomen tulevaisuus",
              "description": "Tarkastelee kansainvälistä kontekstia, jossa maat kilpailevat yhä tiukemmin lahjakkuuksista ja innovaatioista. Analysoi Suomen valintoja ja vertaa Singaporen ja Viron strategioihin.",
              "file": "content/innovaatio_v2_osa3.md"
            },
            {
              "title": "Arvovalinnat ja normatiiviset kysymykset",
              "description": "Tunnustaa rehellisesti, että argumentti sisältää arvovalintoja: usko tasa-arvoisiin mahdollisuuksiin, kollektiivinen vastuu ja pitkän aikavälin ajattelu. Perustelee miksi nämä arvovalinnat ovat puolustettavissa.",
              "file": "content/innovaatio_v2_osa3.md"
            },
            {
              "title": "Johtopäätökset ja suositukset",
              "description": "Kokoaa yhteen keskeiset havainnot ja esittää konkreettisia suosituksia Suomen ja muiden maiden koulutuspolitiikalle. Painottaa, että laaja koulutuspanostus on sekä taloudellisesti järkevää että moraalisesti oikein.",
              "file": "content/innovaatio_v2_osa3.md"
            }
          ]
        }
      ]
    },
    {
      "id": "kokonaisuus-b",
      "title": "KOKONAISUUS B: Hyvinvointivaltion hajoamisen anatomia",
      "description": "Tämä kokonaisuus dokumentoi systemaattisesti, miten hyvinvointivaltiota on heikennetty 1980-luvulta lähtien. Keskeinen argumentti on, että nykyajan ongelmat eivät ole hyvinvointivaltion 'epäonnistumista' vaan sen tahallisen heikentämisen seurausta. Kokonaisuus tarkastelee rahoituspohjan rapautumista globaalisti, Suomen empiiristä kehitystä ja koulutuksen erityistapausta.",
      "parts": [
        {
          "id": "osa-b1",
          "title": "Osa 1: Rahoituspohjan rapautuminen (1980-2020)",
          "description": "Dokumentoi systemaattisesti, miten progressiivinen verotus, yritysverotus ja pääomatulojen verotus ovat heikentyneet globaalisti OECD-maissa 1980-luvulta lähtien. Esittää empiriiristä dataa ja tutkimusta, joka osoittaa että veronalennukset rikkaimmille eivät kasvattaneet taloutta mutta lisäsivät eriarvoisuutta.",
          "file": "content/hyvinvointivaltio_b_osa1.md"
        },
        {
          "id": "osa-b2",
          "title": "Osa 2: Empiirinen evidenssi: Suomen tapaus",
          "description": "Tarkastelee Suomea tapaustutkimuksena siitä, miten pohjoismainen hyvinvointivaltio on muuttunut viime vuosikymmeninä. Dokumentoi eriarvoisuuden dramaattisen kasvun, uudelleenjaon tehokkuuden heikkenemisen ja julkisten menojen 'paisumisen' paradoksin. Esittää, että julkiset menot kasvavat KOSKA hyvinvointivaltiota heikennetään (kalliit reaktiiviset toimet korvaavat halvemmat ennaltaehkäisevät).",
          "file": "content/hyvinvointivaltio_b_osa2.md"
        },
        {
          "id": "osa-b3",
          "title": "Osa 3: Koulutus ja innovaatio resurssileikkausten aikakaudella",
          "description": "Yhdistää rahoituspohjan rapautumisen ja Suomen empiirisen kehityksen innovaation ja koulutuksen kysymyksiin. Osoittaa, että koulutusleikkaukset eivät ole vain 'säästötoimenpiteitä' vaan syövät systemaattisesti yhteiskunnan pitkän aikavälin innovaatiokykyä. Viittaa Mazzucaton tutkimukseen julkisen rahoituksen keskeisyydestä perustutkimuksessa (esim. iPhone:n teknologiat).",
          "file": "content/hyvinvointivaltio_b_osa3.md"
        }
      ]
    },
    {
      "id": "kokonaisuus-c",
      "title": "KOKONAISUUS C: Moraaliset ja psykologiset juuret",
      "description": "Tämä kokonaisuus tarkastelee, miksi hyvinvointivaltio-keskustelu jämähtää usein pattitilanteeseen rationaalisista argumenteista huolimatta. Esittää synteettisen teorian moraalisen päätöksenteon luonteesta, joka yhdistää Jonathan Haidtin Moral Foundations Theory -viitekehystä sen kriitikkojen näkemyksiin sekä Carol Dweckin tutkimukseen mindset-teorioista. Argumentoi, että keskustelu on syvempien moraalisten intuittioiden ja maailmankatsomuksellisten erojen törmäys, ei rationaalinen vääntö faktoista.",
      "parts": [
        {
          "id": "osa-c1",
          "title": "Osa 1: Haidtin Moral Foundations Theory ja kritiikki",
          "description": "Esittelee Jonathan Haidtin tunnetun Moral Foundations Theory -viitekehyksen, joka tunnistaa useita synnynnäisiä 'moraalisia perustuksia': Huolenpito, Oikeudenmukaisuus, Lojaalisuus, Auktoriteetti, Pyhyys. Käsittelee myös teorian merkittävimmät kritiikkikohdat: synnynnäisyyden käsitteen epäselvyys, puuttuvat yhteistyön muodot, ad hoc -luonne ja kulttuurinen variaatio.",
          "file": "content/moraaliset_juuret_osa1.md"
        },
        {
          "id": "osa-c2",
          "title": "Osa 2: Identiteetin läheisyys ja oppimisen mindsetit",
          "description": "Laajentaa Haidtin teoriaa kahdella keskeisellä lisäyksellä: (1) Moraalisten reaktioiden jäykkyys vaihtelee sen mukaan, kuinka lähellä kysymys on yksilön identiteettiä. (2) Carol Dweckin mindset-tutkimuksen soveltaminen moraaliseen ajatteluun: uuden oppiminen voi olla osa identiteettiä (growth mindset) tai uhka identiteetille (fixed mindset). Käsittelee myös traumaattisten kokemusten vaikutusta.",
          "file": "content/moraaliset_juuret_osa2.md"
        },
        {
          "id": "osa-c3",
          "title": "Osa 3: Synteesi ja soveltaminen hyvinvointivaltio-keskusteluun",
          "description": "Yhdistää aiemmat osat integroivaksi teoriaksi ja soveltaa sitä hyvinvointivaltio-keskusteluun. Selittää, miksi rationaaliset argumentit eivät vakuuta: koska kyse on identiteetin lähellä olevista moraalisista intuittioista, ei rationaalisesta väittelystä. Esittää konkreettisia suosituksia rakentavampaan keskusteluun: identiteettiä vahvistava kehystäminen, uuden oppimisen tekeminen nautinnolliseksi ja moraalisten kielien kunnioittaminen.",
          "file": "content/moraaliset_juuret_osa3.md"
        }
      ]
    }
  ]
}
